-- Урок 01, задание 2: КОММЕНТАРИИ
-- ================================
-- ЗАДАНИЕ:
-- 1. Ниже есть три строки print. Сделай так, чтобы выполнялась ТОЛЬКО вторая:
--    первую и третью "заглуши" однострочными комментариями (--).
-- 2. После них добавь многострочный комментарий --[[ ]], внутри которого
--    напиши 2-3 строки: что делает print и что делает комментарий --.
-- 3. Запусти файл. На экране должна остаться только ОДНА строка: "середина".
--
-- ОЖИДАЕМЫЙ РЕЗУЛЬТАТ:
--   середина

-- print("начало")
print("середина")
-- print("конец")

--[[
Функция print печатает в консоль те значения, которые в неё передаются. Это может быть текст, арифметика, значения вычислений других функций и другое.
Комментарий типа "--" работает только с той строкой, вначале которой эти символы прописаны, они игнорируются интерпритатором.
Так же есть многострочный комментарий, внутри которого я сейчас это пишу. Он удобнее, когда нужно писать большой комментарий. Он так же игнорируется интерпритатором.
--]]

-- TODO: закомментируй первую и третью строки выше,
-- TODO: а ниже добавь многострочный комментарий со своим объяснением
