-- Урок 02, задание 2: АНКЕТА (конкатенация и ввод)
-- ==================================================
-- ЗАДАНИЕ:
-- Напиши программу-анкету:
-- 1. Спроси у пользователя имя (выведи приглашение через print).
-- 2. Прочитай имя через io.read() в LOCAL-переменную.
-- 3. Спроси возраст, прочитай, преобразуй в число через tonumber.
-- 4. Выведи одной строкой, склеенной через .. :
--      "Привет, <ИМЯ>! Через год тебе будет <ВОЗРАСТ+1>."
-- 5. В конце выведи типы обеих переменных через type().
--
-- ПРИМЕР РАБОТЫ:
--   Как тебя зовут?
--   > Алекс
--   Сколько тебе лет?
--   > 20
--   Привет, Алекс! Через год тебе будет 21.
--   string    number
--
-- ПОДСКАЗКА МЕНТОРА: если сложишь строку с числом через +,
-- Lua попытается превратить строку в число. А через .. — наоборот.
-- Какой оператор нужен для склейки фразы? Копай в сторону "..".

-- TODO: напиши анкету ниже

print("Как тебя зовут?")
local name = io.read()
print("Сколько тебе лет?")
local age = tonumber(io.read())
print("Привет, " .. name .. "!" .. " Через год тебе будет " .. age + 1 .. ".")
print(type(name), type(age)) -- ты мне слишком мало рассказал про функцию type, мне опять пришлось лесть в интернет, чтобы понять в чем я ошибаюсь